name_mapping = {
    "阿司匹林肠溶片（过评）": "阿司匹林肠溶片100mg",
    "左氧氟沙星片(片剂)": "左氧氟沙星片",
    "琥珀酸美托洛尔缓释胶囊(硬胶囊)": "琥珀酸美托洛尔胶囊",
    "缬沙坦氨氯地平片(片剂)": "缬沙坦氨氯地平片",
    "盐酸伊托必利片(片剂)": "盐酸伊托必利片",
    "缬沙坦氢氯噻嗪片（过评）": "缬沙坦氢氯噻嗪片",
    "瑞巴派特片(片剂)": "瑞巴派特片",
    "艾司奥美拉唑镁肠溶胶囊(硬胶囊)": "艾美",
    "盐酸二甲双胍缓释片（过评）": "盐酸二甲双胍缓释片",
    "非洛地平缓释片": "非诺地平缓释片",
}

spec_mapping = {
    "47.5mg×14粒×2板×400盒": "47.5mg×14片×2板×400盒",
    "10mg×100片×600瓶/10瓶*60包": "100片/瓶*600瓶/箱",
    "80mg×7片×4板×400盒": "7片×4板×400盒",
    "50mg×10片×2板×400盒": "10片×2板×400盒",
    "80mg×14片×2板×400盒": "（80mg:12.5mg）14片×2板×400盒",
    "0.5gx30片x400瓶": "30片/瓶×400盒/箱",
    "40mg*7粒/板*4板/盒*200盒": "40mg×7粒×4板×200盒",
    "20mg*7粒/板*4板/盒*200盒": "20mg×7粒×4板×200盒",
    "0.2g×10片×1板×400盒": "10粒×1板×400盒",
    "0.2g×10片×2板×400盒": "10粒×2板×400盒",
    "0.5mg×12粒×2板×400盒": "0.5mg×12片×2板×400盒",
    "25mg（按C21H29N6O5P计）×15片×4板×400盒": "15片×4板×400盒",
    "23.75mg×14粒×2板×400盒": "23.75mg×14片×2板×400盒",
    "5mg*10片/板*4板*400盒": "10片×4板×400盒",
}
